zhanzr/TC234_Tasking_62_Demo/SoftwarePlatform/illd_tc23x/src/ifx/TC23x/Vadc/Std/IfxVadc.h
/**
 * \file IfxVadc.h
 * \brief VADC  basic functionality
 * \ingroup IfxLld_Vadc
 *
 * \version iLLD_1_0_0_11_0
 * \copyright Copyright (c) 2013 Infineon Technologies AG. All rights reserved.
 *
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Vadc_Std_Enum Enumerations
 * \ingroup IfxLld_Vadc_Std
 * \defgroup IfxLld_Vadc_Std_Background_Autoscan Background Autoscan Functions
 * \ingroup IfxLld_Vadc_Std
 * \defgroup IfxLld_Vadc_Std_ChannelScan Channel Scan Functions
 * \ingroup IfxLld_Vadc_Std
 * \defgroup IfxLld_Vadc_Std_QueueRequest Queue Request Functions
 * \ingroup IfxLld_Vadc_Std
 * \defgroup IfxLld_Vadc_Std_IO IO Pin Configuration Functions
 * \ingroup IfxLld_Vadc_Std
 * \defgroup IfxLld_Vadc_Std_Frequency Frequency Calculation
 * \ingroup IfxLld_Vadc_Std
 * \defgroup IfxLld_Vadc_Std_Group Group Functions
 * \ingroup IfxLld_Vadc_Std
 * \defgroup IfxLld_Vadc_Std_Module Module Functions
 * \ingroup IfxLld_Vadc_Std
 * \defgroup IfxLld_Vadc_Std_Channel Channel Functions
 * \ingroup IfxLld_Vadc_Std
 * \defgroup IfxLld_Vadc_Std_Emux Emux Functions
 * \ingroup IfxLld_Vadc_Std
 */

#ifndef IFXVADC_H
#define IFXVADC_H 1

/******************************************************************************/
/*----------------------------------Includes----------------------------------*/
/******************************************************************************/

#include "_Impl/IfxVadc_cfg.h"
#include "_PinMap/IfxVadc_PinMap.h"
#include "IfxVadc_bf.h"
#include "Cpu/Std/IfxCpu_Intrinsics.h"
#include "Scu/Std/IfxScuCcu.h"
#include "Scu/Std/IfxScuWdt.h"
#include "IfxCcu6_reg.h"
#include "IfxCcu6_bf.h"

/******************************************************************************/
/*--------------------------------Enumerations--------------------------------*/
/******************************************************************************/

/** \addtogroup IfxLld_Vadc_Std_Enum
 * \{ */
/** \brief Defined in MODULE_VADC.G[x].ARBCFG.B.ANONS and ANONC
 */
typedef enum
{
    IfxVadc_AnalogConverterMode_off             = 0, /**< \brief Analog Converter off */
    IfxVadc_AnalogConverterMode_slowStandby     = 1, /**< \brief Slow Standby Mode */
    IfxVadc_AnalogConverterMode_fastStandby     = 2, /**< \brief Fast Standby Mode */
    IfxVadc_AnalogConverterMode_normalOperation = 3  /**< \brief Normal operation mode */
} IfxVadc_AnalogConverterMode;

/** \brief Arbitration round length defined in MODULE_VADC.G[x].ARBCFG.ARBRND(x=0,1,..,11)
 */
typedef enum
{
    IfxVadc_ArbitrationRounds_4_slots  = 0,  /**< \brief An arbitration round contains 4 arbitration slots. */
    IfxVadc_ArbitrationRounds_8_slots  = 1,  /**< \brief An arbitration round contains 8 arbitration slots. */
    IfxVadc_ArbitrationRounds_16_slots = 2,  /**< \brief An arbitration round contains 16 arbitration slots. */
    IfxVadc_ArbitrationRounds_20_slots = 3   /**< \brief An arbitration round contains 20 arbitration slots. */
} IfxVadc_ArbitrationRounds;

/** \brief Boundary Extension defined in MODULE_VADC.G[x].CHCTR[y].B.BNDSELX(x=0,1,...,11;y=0,1....,16)
 */
typedef enum
{
    IfxVadc_BoundaryExtension_standard            = 0,   /**< \brief Boundary Standard mode. BNDSELU/BNDSELL as Boundaries */
    IfxVadc_BoundaryExtension_fastCompareResult1  = 1,   /**< \brief Fast compare mode use as upper boundary  Channel result   1 */
    IfxVadc_BoundaryExtension_fastCompareResult2  = 2,   /**< \brief Fast compare mode use as upper boundary  Channel result   2 */
    IfxVadc_BoundaryExtension_fastCompareResult3  = 3,   /**< \brief Fast compare mode use as upper boundary  Channel result   3 */
    IfxVadc_BoundaryExtension_fastCompareResult4  = 4,   /**< \brief Fast compare mode use as upper boundary  Channel result   4 */
    IfxVadc_BoundaryExtension_fastCompareResult5  = 5,   /**< \brief Fast compare mode use as upper boundary  Channel result   5 */
    IfxVadc_BoundaryExtension_fastCompareResult6  = 6,   /**< \brief Fast compare mode use as upper boundary  Channel result   6 */
    IfxVadc_BoundaryExtension_fastCompareResult7  = 7,   /**< \brief Fast compare mode use as upper boundary  Channel result   7 */
    IfxVadc_BoundaryExtension_fastCompareResult8  = 8,   /**< \brief Fast compare mode use as upper boundary  Channel result   8 */
    IfxVadc_BoundaryExtension_fastCompareResult9  = 9,   /**< \brief Fast compare mode use as upper boundary  Channel result   9 */
    IfxVadc_BoundaryExtension_fastCompareResult10 = 10,  /**< \brief Fast compare mode use as upper boundary  Channel result  10 */
    IfxVadc_BoundaryExtension_fastCompareResult11 = 11,  /**< \brief Fast compare mode use as upper boundary  Channel result  11 */
    IfxVadc_BoundaryExtension_fastCompareResult12 = 12,  /**< \brief Fast compare mode use as upper boundary  Channel result  12 */
    IfxVadc_BoundaryExtension_fastCompareResult13 = 13,  /**< \brief Fast compare mode use as upper boundary  Channel result  13 */
    IfxVadc_BoundaryExtension_fastCompareResult14 = 14,  /**< \brief Fast compare mode use as upper boundary  Channel result  14 */
    IfxVadc_BoundaryExtension_fastCompareResult15 = 15   /**< \brief Fast compare mode use as upper boundary  Channel result  15 */
} IfxVadc_BoundaryExtension;

/** \brief BoundarySel defined in MODULE_VADC.G[x].CHCTR[y].B.BNDSELL(x=0,1,...,11;y=0,1....,16)
 */
typedef enum
{
    IfxVadc_BoundarySelection_group0  = 0,  /**< \brief Use group class 0 */
    IfxVadc_BoundarySelection_group1  = 1,  /**< \brief Use group class 1 */
    IfxVadc_BoundarySelection_global0 = 2,  /**< \brief Use global class 0 */
    IfxVadc_BoundarySelection_global1 = 3   /**< \brief Use global class 1 */
} IfxVadc_BoundarySelection;

/** \brief VADC Channels
 */
typedef enum
{
    IfxVadc_ChannelId_none = -1,  /**< \brief None of VADC channels */
    IfxVadc_ChannelId_0    = 0,   /**< \brief Channel 0 */
    IfxVadc_ChannelId_1    = 1,   /**< \brief Channel 1 */
    IfxVadc_ChannelId_2    = 2,   /**< \brief Channel 2 */
    IfxVadc_ChannelId_3    = 3,   /**< \brief Channel 3 */
    IfxVadc_ChannelId_4    = 4,   /**< \brief Channel 4 */
    IfxVadc_ChannelId_5    = 5,   /**< \brief Channel 5 */
    IfxVadc_ChannelId_6    = 6,   /**< \brief Channel 6 */
    IfxVadc_ChannelId_7    = 7,   /**< \brief Channel 7 */
    IfxVadc_ChannelId_8    = 8,   /**< \brief Channel 8 */
    IfxVadc_ChannelId_9    = 9,   /**< \brief Channel 9 */
    IfxVadc_ChannelId_10   = 10,  /**< \brief Channel 10 */
    IfxVadc_ChannelId_11   = 11   /**< \brief Channel 11 */
} IfxVadc_ChannelId;

/** \brief ADC channel reference defined in MODULE_VADC.G[x].CHCTR[y].B.REFSEL(x=0,1,...,11;y=0,1....,16)
 */
typedef enum
{
    IfxVadc_ChannelReference_standard = 0,  /**< \brief use Varef as reference */
    IfxVadc_ChannelReference_channel0 = 1   /**< \brief use CH0 as reference */
} IfxVadc_ChannelReference;

/** \brief ADC channel resolution defined in MODULE_VADC.G[x].CHCTR[y].B.ICLASS[y].B.CMS(x=0,1,...,11;y=0,1)
 */
typedef enum
{
    IfxVadc_ChannelResolution_12bit     = 0, /**< \brief 12-bit conversion */
    IfxVadc_ChannelResolution_10bit     = 1, /**< \brief 10-bit conversion */
    IfxVadc_ChannelResolution_8bit      = 2, /**< \brief 8-bit conversion */
    IfxVadc_ChannelResolution_10bitFast = 5  /**< \brief 10-bit cfast compare mode */
} IfxVadc_ChannelResolution;

