zhanzr/TC234_Tasking_62_Demo/SoftwarePlatform/illd_tc23x/src/ifx/TC23x/Vadc/Std/IfxVadc.h
/** \brief Channel Result defined in MODULE_VADC.G[x].CHCTR[y].B.RESREG(x=0,1,...,11;y=0,1....,16)
 */
typedef enum
{
    IfxVadc_ChannelResult_0 = 0,      /**< \brief Use Channel result 0  */
    IfxVadc_ChannelResult_1,          /**< \brief Use Channel result 1  */
    IfxVadc_ChannelResult_2,          /**< \brief Use Channel result 2  */
    IfxVadc_ChannelResult_3,          /**< \brief Use Channel result 3  */
    IfxVadc_ChannelResult_4,          /**< \brief Use Channel result 4  */
    IfxVadc_ChannelResult_5,          /**< \brief Use Channel result 5  */
    IfxVadc_ChannelResult_6,          /**< \brief Use Channel result 6  */
    IfxVadc_ChannelResult_7,          /**< \brief Use Channel result 7  */
    IfxVadc_ChannelResult_8,          /**< \brief Use Channel result 8  */
    IfxVadc_ChannelResult_9,          /**< \brief Use Channel result 9  */
    IfxVadc_ChannelResult_10,         /**< \brief Use Channel result 10  */
    IfxVadc_ChannelResult_11,         /**< \brief Use Channel result 11  */
    IfxVadc_ChannelResult_12,         /**< \brief Use Channel result 12  */
    IfxVadc_ChannelResult_13,         /**< \brief Use Channel result 13  */
    IfxVadc_ChannelResult_14,         /**< \brief Use Channel result 14  */
    IfxVadc_ChannelResult_15          /**< \brief Use Channel result 15  */
} IfxVadc_ChannelResult;

/** \brief External Multiplexer Channel Selection Style as defined in
 * Ifx_VADC.G[x].EMUXCTR.B.EMXCSS
 */
typedef enum
{
    IfxVadc_ChannelSelectionStyle_channelNumber = 0,  /**< \brief selects an arbitrary channel */
    IfxVadc_ChannelSelectionStyle_binary        = 1   /**< \brief Each bit of bitfield EMUXCH selects the
                                                       * associated channel for EMUX control */
} IfxVadc_ChannelSelectionStyle;

/** \brief type of conversion
 */
typedef enum
{
    IfxVadc_ConversionType_Compatible = 0  /**< \brief Compatible Timing Mode */
} IfxVadc_ConversionType;

/** \brief Specifies the External Coding scheme(binary/gray)
 * defined in Ifx_VADC.G[x].EMUXCTR.B.EMXCOD
 */
typedef enum
{
    IfxVadc_EmuxCodingScheme_binary = 0,  /**< \brief Output the Channel Number in Binary code */
    IfxVadc_EmuxCodingScheme_gray   = 1   /**< \brief Output the channel number in gray code */
} IfxVadc_EmuxCodingScheme;

/** \brief Specifies the Emux interface
 */
typedef enum
{
    IfxVadc_EmuxInterface_0 = 0,  /**< \brief Emux Interface 0 */
    IfxVadc_EmuxInterface_1 = 1   /**< \brief Emux Interface 1 */
} IfxVadc_EmuxInterface;

/** \brief External Multiplexer sample time control
 * defined in Ifx_VADC.G[x].EMUXCTR.B.EMXST
 */
typedef enum
{
    IfxVadc_EmuxSampleTimeControl_settingChanges = 0,  /**< \brief Use STCE Whenever Setting Changes */
    IfxVadc_EmuxSampleTimeControl_always         = 1   /**< \brief Use STCE for each conversion of an external channel */
} IfxVadc_EmuxSampleTimeControl;

/** \brief specifies the External Channel Start select value
 * defined in Ifx_VADC.G[x].EMUXCTR.B.EMUXSET
 */
typedef enum
{
    IfxVadc_EmuxSelectValue_0 = 0,      /**< \brief Start Selection Value 0  */
    IfxVadc_EmuxSelectValue_1,          /**< \brief Start Selection Value 1  */
    IfxVadc_EmuxSelectValue_2,          /**< \brief Start Selection Value 2  */
    IfxVadc_EmuxSelectValue_3,          /**< \brief Start Selection Value 3  */
    IfxVadc_EmuxSelectValue_4,          /**< \brief Start Selection Value 4  */
    IfxVadc_EmuxSelectValue_5,          /**< \brief Start Selection Value 5  */
    IfxVadc_EmuxSelectValue_6,          /**< \brief Start Selection Value 6  */
    IfxVadc_EmuxSelectValue_7           /**< \brief Start Selection Value 7  */
} IfxVadc_EmuxSelectValue;

/** \brief Specifies External Multiplexer Mode
 * define in Ifx_VADC.G[x].EMUXCTR.B.EMUXMODE
 */
typedef enum
{
    IfxVadc_ExternalMultiplexerMode_softwareControl = 0,  /**< \brief Disable The Emux Control */
    IfxVadc_ExternalMultiplexerMode_steady          = 1,  /**< \brief select steady mode */
    IfxVadc_ExternalMultiplexerMode_singleStep      = 2,  /**< \brief Select single step mode */
    IfxVadc_ExternalMultiplexerMode_sequence        = 3   /**< \brief Select Sequence Mode */
} IfxVadc_ExternalMultiplexerMode;

/** \brief FIFO mode enable
 */
typedef enum
{
    IfxVadc_FifoMode_seperateResultRegister = 0,  /**< \brief seperate Result Register */
    IfxVadc_FifoMode_fifoStructure          = 1,  /**< \brief fifoStructure */
    IfxVadc_FifoMode_maximumMode            = 2,  /**< \brief copy new result if bigger */
    IfxVadc_FifoMode_minimumMode            = 3   /**< \brief copy new result if it is smaller */
} IfxVadc_FifoMode;

/** \brief gating mode defined in MODULE_VADC.BRSMR.ENGT
 */
typedef enum
{
    IfxVadc_GatingMode_disabled   = 0,  /**< \brief Gating is disabled, no conversion request are issued */
    IfxVadc_GatingMode_always     = 1,  /**< \brief Conversion request is issued if at least 1 conversion pending bit is set */
    IfxVadc_GatingMode_gatingHigh = 2,  /**< \brief Conversion request is issued if at least 1 conversion pending bit is set and the gating signal is high */
    IfxVadc_GatingMode_gatingLow  = 3   /**< \brief Conversion request is issued if at least 1 conversion pending bit is set and the gating signal is low */
} IfxVadc_GatingMode;

/** \brief External trigger gating defined in MODULE_VADC.G[x].QCTRLy.GTSEL(x=0,1,..,11;y=0,1,..,7)
 */
typedef enum
{
    IfxVadc_GatingSource_0 = 0,      /**< \brief Input signal REQGTx_0  */
    IfxVadc_GatingSource_1,          /**< \brief Input signal REQGTx_1  */
    IfxVadc_GatingSource_2,          /**< \brief Input signal REQGTx_2  */
    IfxVadc_GatingSource_3,          /**< \brief Input signal REQGTx_3  */
    IfxVadc_GatingSource_4,          /**< \brief Input signal REQGTx_4  */
    IfxVadc_GatingSource_5,          /**< \brief Input signal REQGTx_5  */
    IfxVadc_GatingSource_6,          /**< \brief Input signal REQGTx_6  */
    IfxVadc_GatingSource_7,          /**< \brief Input signal REQGTx_7  */
    IfxVadc_GatingSource_8,          /**< \brief Input signal REQGTx_8  */
    IfxVadc_GatingSource_9,          /**< \brief Input signal REQGTx_9  */
    IfxVadc_GatingSource_10,         /**< \brief Input signal REQGTx_10  */
    IfxVadc_GatingSource_11,         /**< \brief Input signal REQGTx_11  */
    IfxVadc_GatingSource_12,         /**< \brief Input signal REQGTx_12  */
    IfxVadc_GatingSource_13,         /**< \brief Input signal REQGTx_13  */
    IfxVadc_GatingSource_14,         /**< \brief Input signal REQGTx_14  */
    IfxVadc_GatingSource_15          /**< \brief Input signal REQGTx_15  */
} IfxVadc_GatingSource;

/** \brief inputClass defined in MODULE_VADC.G[x].CHCTR[y].B.ICLSEL(x=0,1,...,11;y=0,1....,16)
 */
typedef enum
{
    IfxVadc_InputClasses_group0  = 0,  /**< \brief Use group class 0 */
    IfxVadc_InputClasses_group1  = 1,  /**< \brief Use group class 1 */
    IfxVadc_InputClasses_global0 = 2,  /**< \brief Use global class 0 */
    IfxVadc_InputClasses_global1 = 3   /**< \brief Use global class 1 */
} IfxVadc_InputClasses;

/** \brief ADC channel limit check defined in MODULE_VADC.G[x].CHCTR[y].B.CHEVMODE(x=0,1,...,11;y=0,1....,16)
 */
typedef enum
{
    IfxVadc_LimitCheck_noCheck            = 0,  /**< \brief Normal compare mode Event Never Fast Compare mode Event Never */
    IfxVadc_LimitCheck_eventIfInArea      = 1,  /**< \brief Normal compare mode Event If result is inside the boundary band    Fast Compare mode Event If result switches to high (above comp. value) */
    IfxVadc_LimitCheck_eventIfOutsideArea = 2,  /**< \brief Normal compare mode Event If result is outside the boundary band   Fast Compare mode Event If result switches to low (below comp. value) */
    IfxVadc_LimitCheck_always             = 3   /**< \brief Normal compare mode Event Always   Fast Compare mode Event Always */
} IfxVadc_LimitCheck;

