zhanzr/TC234_Tasking_62_Demo/SoftwarePlatform/illd_tc23x/src/ifx/TC23x/Vadc/Std/IfxVadc.h
/** \brief Service Node defined in MODULE_VADC.G[x].SRACT.U(x= 0,1,..,11)
 */
typedef enum
{
    IfxVadc_SrcNr_group0  = 0,  /**< \brief service request line 0 of group */
    IfxVadc_SrcNr_group1  = 1,  /**< \brief service request line 1 of group */
    IfxVadc_SrcNr_group2  = 2,  /**< \brief service request line 2 of group */
    IfxVadc_SrcNr_group3  = 3,  /**< \brief service request line 3 of group */
    IfxVadc_SrcNr_shared0 = 4,  /**< \brief Select shared service request line 0 */
    IfxVadc_SrcNr_shared1 = 5,  /**< \brief Select shared service request line 1 */
    IfxVadc_SrcNr_shared2 = 6,  /**< \brief Select shared service request line 2 */
    IfxVadc_SrcNr_shared3 = 7   /**< \brief Select shared service request line 3 */
} IfxVadc_SrcNr;

/** \brief API return values defined in
 * MODULE_VADC.G[x].QSR0.U,MODULE_VADC.G[x].ASPND.U
 * MODULE_VADC.BRSPND[x](x=0,1,...,11)
 */
typedef enum
{
    IfxVadc_Status_noError              = 0, /**< \brief No error during api execution */
    IfxVadc_Status_notInitialised       = 1, /**< \brief Appropriate initialisation not done */
    IfxVadc_Status_invalidGroup         = 2, /**< \brief Invalid group number */
    IfxVadc_Status_invalidChannel       = 3, /**< \brief Invalid channel number */
    IfxVadc_Status_queueFull            = 4, /**< \brief Queue is full */
    IfxVadc_Status_noAccess             = 5, /**< \brief Access to the group/channel is disabled */
    IfxVadc_Status_channelsStillPending = 6  /**< \brief Conversion for some of the channels are still pending */
} IfxVadc_Status;

/** \brief trigger definition defined in MODULE_VADC.G[x].QCTRL0.XTMODE(x=0,1,..,11)
 */
typedef enum
{
    IfxVadc_TriggerMode_noExternalTrigger = 0,  /**< \brief No external trigger */
    IfxVadc_TriggerMode_uponFallingEdge   = 1,  /**< \brief Trigger event upon a falling edge */
    IfxVadc_TriggerMode_uponRisingEdge    = 2,  /**< \brief Trigger event upon a rising edge */
    IfxVadc_TriggerMode_uponAnyEdge       = 3   /**< \brief Trigger event upon any edge */
} IfxVadc_TriggerMode;

/** \brief Trigger request source defined in MODULE_VADC.G[x].QCTRLy.XTSEL(x=0,1,..,11;y=0,1,..,7)
 */
typedef enum
{
    IfxVadc_TriggerSource_0 = 0,      /**< \brief Input signal REQTRx_0  */
    IfxVadc_TriggerSource_1,          /**< \brief Input signal REQTRx_1  */
    IfxVadc_TriggerSource_2,          /**< \brief Input signal REQTRx_2  */
    IfxVadc_TriggerSource_3,          /**< \brief Input signal REQTRx_3  */
    IfxVadc_TriggerSource_4,          /**< \brief Input signal REQTRx_4  */
    IfxVadc_TriggerSource_5,          /**< \brief Input signal REQTRx_5  */
    IfxVadc_TriggerSource_6,          /**< \brief Input signal REQTRx_6  */
    IfxVadc_TriggerSource_7,          /**< \brief Input signal REQTRx_7  */
    IfxVadc_TriggerSource_8,          /**< \brief Input signal REQTRx_8  */
    IfxVadc_TriggerSource_9,          /**< \brief Input signal REQTRx_9  */
    IfxVadc_TriggerSource_10,         /**< \brief Input signal REQTRx_10  */
    IfxVadc_TriggerSource_11,         /**< \brief Input signal REQTRx_11  */
    IfxVadc_TriggerSource_12,         /**< \brief Input signal REQTRx_12  */
    IfxVadc_TriggerSource_13,         /**< \brief Input signal REQTRx_13  */
    IfxVadc_TriggerSource_14,         /**< \brief Input signal REQTRx_14  */
    IfxVadc_TriggerSource_15          /**< \brief Input signal REQTRx_15  */
} IfxVadc_TriggerSource;

/** \} */

/** \addtogroup IfxLld_Vadc_Std_Background_Autoscan
 * \{ */

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief access function to enable/disable  wait for read mode for result registers
 * \param group pointer to the VADC group
 * \param resultIdx result register index
 * \param waitForRead wait for read mode enabled/disabled
 * \return None
 */
IFX_INLINE void IfxVadc_configureWaitForReadMode(Ifx_VADC_G *group, uint32 resultIdx, boolean waitForRead);

/** \brief access function to enable/disable  wait for read mode for global result register
 * \param vadc pointer to the VADC
 * \param waitForRead wait for read mode enabled/disabled
 * \return None
 */
IFX_INLINE void IfxVadc_configureWaitForReadModeForGlobalResultRegister(Ifx_VADC *vadc, boolean waitForRead);

/** \brief Enables the background sacn external trigger.
 * \param vadc pointer to the base of VADC registers.
 * \return None
 */
IFX_INLINE void IfxVadc_enableBackgroundScanSlotExternalTrigger(Ifx_VADC *vadc);

/** \brief Gets the background scan gating mode.
 * \param vadc pointer to the base of VADC registers.
 * \return background scan gating mode.
 */
IFX_INLINE IfxVadc_GatingMode IfxVadc_getBackgroundScanGatingMode(Ifx_VADC *vadc);

/** \brief Gets the gating input selection.
 * \param vadc pointer to the base of VADC registers.
 * \return background scan gating input selection.
 */
IFX_INLINE IfxVadc_GatingSource IfxVadc_getBackgroundScanGatingSource(Ifx_VADC *vadc);

/** \brief Gets the requested background scan slot priority.
 * \param vadcG pointer to VADC group registers.
 * \return requested background scan slot priority.
 */
IFX_INLINE IfxVadc_RequestSlotPriority IfxVadc_getBackgroundScanSlotPriority(Ifx_VADC_G *vadcG);

/** \brief Gets the requested background scan slot start mode.
 * \param vadcG pointer to VADC group registers.
 * \return requested background scan slot start mode.
 */
IFX_INLINE IfxVadc_RequestSlotStartMode IfxVadc_getBackgroundScanSlotStartMode(Ifx_VADC_G *vadcG);

/** \brief Gets the background scan trigger input.
 * \param vadc pointer to the base of VADC registers.
 * \return Gets the background scan external trigger source.
 */
IFX_INLINE IfxVadc_TriggerSource IfxVadc_getBackgroundScanTriggerInput(Ifx_VADC *vadc);

/** \brief Gets the background scan external trigger mode.
 * \param vadc pointer to the base of VADC registers.
 * \return background scan external trigger mode.
 */
IFX_INLINE IfxVadc_TriggerMode IfxVadc_getBackgroundScanTriggerMode(Ifx_VADC *vadc);

/** \brief get global input class resolution
 * \param vadc Pointer to the VADC Group
 * \param inputClassNum global input class number
 * \return ADC input class channel resolution.
 */
IFX_INLINE IfxVadc_ChannelResolution IfxVadc_getGlobalResolution(Ifx_VADC *vadc, uint8 inputClassNum);

/** \brief return conversion result stored in the Global result Register
 * \param vadc pointer to the VADC module
 * \return global result register
 *
 * \code
 * Ifx_VADC* vadc = &MODULE_VADC; // module pointer
 * IfxVadc_GroupId groupId = IfxVadc_GroupId0; // for group 0
 * uint32 channels = (1 << 5) | (1 << 2); // enable channel #5 and #2
 * uint32 mask = (1 << 7) | (1 << 5) | (1 << 2); // modify the selection for channel #7, #5 and #2; channel #7 will be disabled
 *
 * //confiure wait for read mode for global result register
 * IfxVadc_configureWaitForReadModeForGlobalResultRegister(vadc, TRUE);
 *
 * // configure background scan
 * IfxVadc_setBackgroundScan(vadc, groupId, channels, mask);
 *
 * // enable auto scan
 * IfxVadc_SetAutoBackgroundScan(vadc, TRUE);
 *
 * // start the background scan
 * IfxVadc_startBackgroundScan(vadc);
 *
 * Ifx_VADC_GLOBRES result;
 * result = IfxVadc_getGlobalResult (vadc);
 *
 * \endcode
 *
 */
IFX_INLINE Ifx_VADC_GLOBRES IfxVadc_getGlobalResult(Ifx_VADC *vadc);

/** \brief get global input class sample time in sec
 * \param vadc Pointer to the VADC Group Register space
 * \param inputClassNum ADC input class number
 * \param analogFrequency ADC module analog frequency in Hz.
 * \return ADC input class channel sample time in sec.
 */
IFX_INLINE float32 IfxVadc_getGlobalSampleTime(Ifx_VADC *vadc, uint8 inputClassNum, float32 analogFrequency);

/** \brief Get conversion result for the group
 * \param group pointer to the VADC group
 * \param results pointer to scaled conversion results
 * \param resultOffset offset for the first result
 * \param numResults number of results
 * \return None
 *
 * \code
 * Ifx_VADC* vadc = &MODULE_VADC
 * Ifx_VADC_G* group = &MODULE_VADC.G[0]; // for group 0
 * uint32 channels = (1 << 5) | (1 << 2); // enable channel #5 and #2
 * uint32 mask = (1 << 7) | (1 << 5) | (1 << 2); // modify the selection for channel #7, #5 and #2; channel #7 will be disabled
 *
 * //confiure wait for read mode for global result register
 * IfxVadc_configureWaitForReadMode(group,IfxVadc_ChannelResult0, TRUE);
 * IfxVadc_configureWaitForReadMode(group,IfxVadc_ChannelResult1, TRUE);
 *
 * // configure scan
 * IfxVadc_setScan(group, channels, mask);
 *
 * // enable auto scan
 * IfxVadc_setAutoScan(group, TRUE);
 *
 * // start the scan
 * IfxVadc_startScan(group);
 *
 * // wait for conversion to finish
 *
 * // fetch the 2 results of conversion for group 0
 * Ifx_VADC_RES results[10];
 * result = IfxVadc_getGroupResult(group, results, 0, 2);
 * \endcode
 *
 */
IFX_INLINE void IfxVadc_getGroupResult(Ifx_VADC_G *group, Ifx_VADC_RES *results, uint32 resultOffset, uint32 numResults);

