zhanzr/TC234_Tasking_62_Demo/SoftwarePlatform/illd_tc23x/src/ifx/TC23x/Vadc/Std/IfxVadc.h
/** \brief Get conversion result (Function does not care about the alignment)
 * value = raw * gain + offset.
 * \param group pointer to the VADC group
 * \param resultIdx result register index
 * \return scaled Conversion result
 *
 * \code
 * Ifx_VADC_G* group = &MODULE_VADC.G[0]; // for group 0
 * uint32 channels = (1 << 5) | (1 << 2); // enable channel #5 and #2
 * uint32 mask = (1 << 7) | (1 << 5) | (1 << 2); // modify the selection for channel #7, #5 and #2; channel #7 will be disabled
 *
 * //confiure wait for read mode for global result register
 * IfxVadc_configureWaitForReadMode(group,IfxVadc_ChannelResult0, TRUE);
 * IfxVadc_configureWaitForReadMode(group,IfxVadc_ChannelResult1, TRUE);
 *
 * // configure scan
 * IfxVadc_setScan(group, channels, mask);
 *
 * // enable auto scan
 * IfxVadc_setAutoScan(group, TRUE);
 *
 * // start the scan
 * IfxVadc_startScan(group);
 *
 * // wait for conversion to finish
 *
 * // fetch the result of conversion from result register 0 for group 0
 * Ifx_VADC_RES result;
 * result = IfxVadc_getResult(group, IfxVadc_ChannelResult0);
 * \endcode
 *
 */
IFX_INLINE Ifx_VADC_RES IfxVadc_getResult(Ifx_VADC_G *group, uint32 resultIdx);

/** \brief Returns the auto background scan status.
 * \param vadc pointer to the base of VADC registers.
 * \return TRUE if enabled otherwise FALSE.
 */
IFX_INLINE boolean IfxVadc_isAutoBackgroundScanEnabled(Ifx_VADC *vadc);

/** \brief Returns the background scan slot requested status.
 * \param vadcG pointer to VADC group registers.
 * \return background scan slot requested status.
 */
IFX_INLINE boolean IfxVadc_isRequestBackgroundScanSlotEnabled(Ifx_VADC_G *vadcG);

/** \brief Enables/Disables continuous background auto scan
 * \param vadc pointer to the base of VADC registers.
 * \param autoBackgroundScanEnable whether auto background scan enabled or not.
 * \return None
 */
IFX_INLINE void IfxVadc_setAutoBackgroundScan(Ifx_VADC *vadc, boolean autoBackgroundScanEnable);

/** \brief configures a background scan; can also stop autoscan if all channels are 0
 * \param vadc pointer to the VADC module registers
 * \param groupId group index
 * \param channels specifies the channels which should be enabled/disabled
 * \param mask specifies the channels which should be modified
 * \return None
 *
 * Background scan can be enabled/disabled for the given channels which are selected with the mask
 *
 * \code
 * Ifx_VADC* vadc = &MODULE_VADC; // module pointer
 * IfxVadc_GroupId groupId = IfxVadc_GroupId0; // for group 0
 * uint32 channels = (1 << 5) | (1 << 2); // enable channel #5 and #2
 * uint32 mask = (1 << 7) | (1 << 5) | (1 << 2); // modify the selection for channel #7, #5 and #2; channel #7 will be disabled
 *
 * //confiure wait for read mode for global result register
 * IfxVadc_configureWaitForReadModeForGlobalResultRegister(vadc, TRUE);
 *
 * // configure background scan
 * IfxVadc_setBackgroundScan(vadc, groupId, channels, mask);
 *
 * // enable auto scan
 * IfxVadc_setAutoBackgroundScan(vadc, TRUE);
 *
 * // start the background scan
 * IfxVadc_startBackgroundScan(vadc);
 * \endcode
 *
 */
IFX_INLINE void IfxVadc_setBackgroundScan(Ifx_VADC *vadc, IfxVadc_GroupId groupId, uint32 channels, uint32 mask);

/** \brief Sets the background scan slot gating configurations.
 * \param vadc pointer to the base of VADC registers.
 * \param gatingSource gate input for group.
 * \param gatingMode gating mode. High level, Low Level  or Gating disabled.
 * \return None
 */
IFX_INLINE void IfxVadc_setBackgroundScanSlotGatingConfig(Ifx_VADC *vadc, IfxVadc_GatingSource gatingSource, IfxVadc_GatingMode gatingMode);

/** \brief Sets the background scan exteranal trigger operating configurations.
 * \param vadc pointer to the base of VADC registers.
 * \param triggerMode trigger mode. Rising, falling any edge leads to an trigger event.
 * \param triggerSource trigger input for group.
 * \return None
 */
IFX_INLINE void IfxVadc_setBackgroundScanSlotTriggerConfig(Ifx_VADC *vadc, IfxVadc_TriggerMode triggerMode, IfxVadc_TriggerSource triggerSource);

/** \brief Starts a background scan
 * \param vadc pointer to the VADC module
 * \return None
 *
 * \see IfxVadc_setBackgroundScan
 *
 */
IFX_INLINE void IfxVadc_startBackgroundScan(Ifx_VADC *vadc);

/******************************************************************************/
/*-------------------------Global Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Gives the background scan status for a group
 * \param vadc pointer to the VADC module
 * \return IfxVadc_Status
 */
IFX_EXTERN IfxVadc_Status IfxVadc_getBackgroundScanStatus(Ifx_VADC *vadc);

/** \brief Get conversion result (Function does not care about the alignment)
 * value = raw * gain + offset.
 * \param vadc VADC module pointer
 * \param group pointer to the VADC group
 * \param channel channel Id
 * \param sourceType type of request source
 * \return scaled Conversion result
 *
 * \code
 * Ifx_VADC vadc;
 * vadc.vadc = &MODULE_VADC;
 * Ifx_VADC_G* group = &MODULE_VADC.G[0]; // for group 0
 * uint32 channels = (1 << 5) | (1 << 2); // enable channel #5 and #2
 * uint32 mask = (1 << 7) | (1 << 5) | (1 << 2); // modify the selection for channel #7, #5 and #2; channel #7 will be disabled
 *
 * //confiure wait for read mode for global result register
 * IfxVadc_configureWaitForReadMode(group,IfxVadc_ChannelResult0, TRUE);
 * IfxVadc_configureWaitForReadMode(group,IfxVadc_ChannelResult1, TRUE);
 *
 * // configure scan
 * IfxVadc_setScan(group, channels, mask);
 *
 * // start the scan
 * IfxVadc_startScan(group);
 *
 * // wait for conversion to finish
 *
 * // fetch the result of conversion for channel 2 of group 0
 * Ifx_VADC_RESresult2;
 * result = IfxVadc_getResultBasedOnRequestSource(&vadc, group, IfxVadc_ChannelId2, IfxVadc_RequestSource_scan);
 * Ifx_VADC_RESresult5;
 * result = IfxVadc_getResultBasedOnRequestSource(&vadc, group, IfxVadc_ChannelId5, IfxVadc_RequestSource_scan);
 * \endcode
 *
 */
IFX_EXTERN Ifx_VADC_RES IfxVadc_getResultBasedOnRequestSource(Ifx_VADC *vadc, Ifx_VADC_G *group, IfxVadc_ChannelId channel, IfxVadc_RequestSource sourceType);

