zhanzr/TC234_Tasking_62_Demo/SoftwarePlatform/illd_tc23x/src/ifx/TC23x/Vadc/Std/IfxVadc.h
/** \} */

/** \addtogroup IfxLld_Vadc_Std_ChannelScan
 * \{ */

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Disables the scan slot external trigger.
 * \param vadcG pointer to VADC group registers.
 * \return None
 */
IFX_INLINE void IfxVadc_disableScanSlotExternalTrigger(Ifx_VADC_G *vadcG);

/** \brief Enables the scan slot external trigger.
 * \param vadcG pointer to VADC group registers.
 * \return None
 */
IFX_INLINE void IfxVadc_enableScanSlotExternalTrigger(Ifx_VADC_G *vadcG);

/** \brief Gets the request scan slot gating mode.
 * \param vadcG pointer to VADC group registers.
 * \return requested scan slot gating mode.
 */
IFX_INLINE IfxVadc_GatingMode IfxVadc_getScanSlotGatingMode(Ifx_VADC_G *vadcG);

/** \brief Gets the request scan slot gating input.
 * \param vadcG pointer to VADC group registers.
 * \return request scan slot gating input.
 */
IFX_INLINE IfxVadc_GatingSource IfxVadc_getScanSlotGatingSource(Ifx_VADC_G *vadcG);

/** \brief Gets the request scan slot priority.
 * \param vadcG pointer to VADC group registers.
 * \return request scan slot priority.
 */
IFX_INLINE IfxVadc_RequestSlotPriority IfxVadc_getScanSlotPriority(Ifx_VADC_G *vadcG);

/** \brief Gets the request scan slot start mode.
 * \param vadcG pointer to VADC group registers.
 * \return request scan slot start mode.
 */
IFX_INLINE IfxVadc_RequestSlotStartMode IfxVadc_getScanSlotStartMode(Ifx_VADC_G *vadcG);

/** \brief Gets the requested scan slot trigger input.
 * \param vadcG pointer to VADC group registers.
 * \return requested scan slot trigger input.
 */
IFX_INLINE IfxVadc_TriggerSource IfxVadc_getScanSlotTriggerInput(Ifx_VADC_G *vadcG);

/** \brief Gets the requested scan slot trigger mode.
 * \param vadcG pointer to VADC group registers.
 * \return requested scan slot trigger mode.
 */
IFX_INLINE IfxVadc_TriggerMode IfxVadc_getScanSlotTriggerMode(Ifx_VADC_G *vadcG);

/** \brief Gets the auto scan enable status.
 * \param vadcG pointer to VADC group registers.
 * \return TRUE if auto scan enabled otherwise FALSE.
 */
IFX_INLINE boolean IfxVadc_isAutoScanEnabled(Ifx_VADC_G *vadcG);

/** \brief Returns the scan slot requested status.
 * \param vadcG pointer to VADC group registers.
 * \return TRUE if scan slot request enabled otherwise FALSE.
 */
IFX_INLINE boolean IfxVadc_isRequestScanSlotEnabled(Ifx_VADC_G *vadcG);

/** \brief Enables/Disables continuous auto scan
 * \param vadcG pointer to VADC group registers.
 * \param autoscanEnable whether autoscan is enabled or not.
 * \return None
 */
IFX_INLINE void IfxVadc_setAutoScan(Ifx_VADC_G *vadcG, boolean autoscanEnable);

/** \brief Sets the scan slot gating configuration.
 * \param vadcG pointer to VADC group registers.
 * \param gatingSource gate input for group.
 * \param gatingMode gating mode. High level, Low Level  or Gating disabled.
 * \return None
 */
IFX_INLINE void IfxVadc_setScanSlotGatingConfig(Ifx_VADC_G *vadcG, IfxVadc_GatingSource gatingSource, IfxVadc_GatingMode gatingMode);

/** \brief Sets the scan slot trigger operating configurations.
 * \param vadcG pointer to VADC group registers.
 * \param triggerMode trigger mode. Rising, falling any edge leads to an trigger event.
 * \param triggerSource trigger input for group.
 * \return None
 */
IFX_INLINE void IfxVadc_setScanSlotTriggerConfig(Ifx_VADC_G *vadcG, IfxVadc_TriggerMode triggerMode, IfxVadc_TriggerSource triggerSource);

/** \brief Starts an autoscan on the specified group
 * \param group pointer to the VADC group
 * \return None
 *
 * See \ref IfxVadc_setScan
 *
 */
IFX_INLINE void IfxVadc_startScan(Ifx_VADC_G *group);

/******************************************************************************/
/*-------------------------Global Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Gives the scan status for a group
 * \param group pointer to the VADC group
 * \return IfxVadc_Status
 */
IFX_EXTERN IfxVadc_Status IfxVadc_getScanStatus(Ifx_VADC_G *group);

/** \brief Configures an (auto-)scan
 * \param group pointer to the VADC group
 * \param channels specifies the channels which should be enabled/disabled
 * \param mask specifies the channels which should be modified
 * \return None
 *
 * (Auto-)Scan can be enabled/disabled for the given channels which are selected with the mask
 *
 * \code
 * Ifx_VADC_G* group = &MODULE_VADC.G[0]; // for group 0
 * uint32 channels = (1 << 5) | (1 << 2); // enable channel #5 and #2
 * uint32 mask = (1 << 7) | (1 << 5) | (1 << 2); // modify the selection for channel #7, #5 and #2; channel #7 will be disabled
 *
 * // configure scan
 * IfxVadc_setScan(group, channels, mask);
 *
 * // enable Auto-Scan
 * IfxVadc_setAutoScan(group, TRUE);
 *
 * // start the scan
 * IfxVadc_startScan(group);
 * \endcode
 *
 */
IFX_EXTERN void IfxVadc_setScan(Ifx_VADC_G *group, uint32 channels, uint32 mask);

/** \} */

/** \addtogroup IfxLld_Vadc_Std_QueueRequest
 * \{ */

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Add an entry to the queue of a group for the specified channel with the following options set:
 * refill incase of aborted conversion
 * source interrupt enable/disable
 * external trigger control of the aborted conversion
 * \param group pointer to the VADC group
 * \param channel specifies channel Id
 * \param options specifies the refill, source interrupt enable/disable and external trigger control selection
 * \return None
 *
 * \code
 *
 * Ifx_VADC_G* group = &MODULE_VADC.G[0]; // for group 0
 * IfxVadc_ChannelId channel = 1; // for channel 1
 * // Add channel 1 to queue of group 0 with the refill turned on
 * IfxVadc_addToQueue(qroup, channel, (1<<IFX_VADC_G_QBUR0_RF_OFF));
 * \endcode
 *
 */
IFX_INLINE void IfxVadc_addToQueue(Ifx_VADC_G *group, IfxVadc_ChannelId channel, uint32 options);

/** \brief Clears all the queue entries including backup stage.
 * \param vadcG pointer to VADC group registers.
 * \param flushQueue Whether queue is cleared or not.
 * \return None
 */
IFX_INLINE void IfxVadc_clearQueue(Ifx_VADC_G *vadcG, boolean flushQueue);

/** \brief Disables the external trigger.
 * \param vadcG pointer to VADC group registers.
 * \return None
 */
IFX_INLINE void IfxVadc_disableQueueSlotExternalTrigger(Ifx_VADC_G *vadcG);

/** \brief Enables the external trigger.
 * \param vadcG pointer to VADC group registers.
 * \return None
 */
IFX_INLINE void IfxVadc_enableQueueSlotExternalTrigger(Ifx_VADC_G *vadcG);

