zhanzr/TC234_Tasking_62_Demo/SoftwarePlatform/illd_tc23x/src/ifx/TC23x/Vadc/Std/IfxVadc.h
/** \brief Gets the requested queue slot gating mode.
 * \param vadcG pointer to VADC group registers.
 * \return requested queue slot gating mode.
 */
IFX_INLINE IfxVadc_GatingMode IfxVadc_getQueueSlotGatingMode(Ifx_VADC_G *vadcG);

/** \brief Gets the requested queue slot gating input.
 * \param vadcG pointer to VADC group registers.
 * \return requested queue slot gating input.
 */
IFX_INLINE IfxVadc_GatingSource IfxVadc_getQueueSlotGatingSource(Ifx_VADC_G *vadcG);

/** \brief Gets the request queue slot priority.
 * \param vadcG pointer to VADC group registers.
 * \return requested queue slot priority.
 */
IFX_INLINE IfxVadc_RequestSlotPriority IfxVadc_getQueueSlotPriority(Ifx_VADC_G *vadcG);

/** \brief Gets the requested queue slot start mode.
 * \param vadcG pointer to VADC group registers.
 * \return requested queue slot start mode.
 */
IFX_INLINE IfxVadc_RequestSlotStartMode IfxVadc_getQueueSlotStartMode(Ifx_VADC_G *vadcG);

/** \brief Gets the requested queue slot trigger input.
 * \param vadcG pointer to VADC group registers.
 * \return requested queue slot trigger input.
 */
IFX_INLINE IfxVadc_TriggerSource IfxVadc_getQueueSlotTriggerInput(Ifx_VADC_G *vadcG);

/** \brief Gets the requested queue slot trigger mode.
 * \param vadcG pointer to VADC group registers.
 * \return requested queue slot trigger mode.
 */
IFX_INLINE IfxVadc_TriggerMode IfxVadc_getQueueSlotTriggerMode(Ifx_VADC_G *vadcG);

/** \brief Returns the queue slot requested status.
 * \param vadcG pointer to VADC group registers.
 * \return TRUE if queue slot request enabled otherwise FALSE.
 */
IFX_INLINE boolean IfxVadc_isRequestQueueSlotEnabled(Ifx_VADC_G *vadcG);

/** \brief Sets the gating configurations.
 * \param vadcG pointer to VADC group registers.
 * \param gatingSource gate input for group.
 * \param gatingMode gating mode. High level, Low Level  or Gating disabled.
 * \return None
 */
IFX_INLINE void IfxVadc_setQueueSlotGatingConfig(Ifx_VADC_G *vadcG, IfxVadc_GatingSource gatingSource, IfxVadc_GatingMode gatingMode);

/** \brief Sets the trigger operating configurations.
 * \param vadcG pointer to VADC group registers.
 * \param triggerMode trigger mode. Rising, falling any edge leads to an trigger event.
 * \param triggerSource trigger input for group.
 * \return None
 */
IFX_INLINE void IfxVadc_setQueueSlotTriggerOperatingConfig(Ifx_VADC_G *vadcG, IfxVadc_TriggerMode triggerMode, IfxVadc_TriggerSource triggerSource);

/** \brief Starts a queue of a group by generating a trigger event through software
 * \param group pointer to the VADC group
 * \return None
 */
IFX_INLINE void IfxVadc_startQueue(Ifx_VADC_G *group);

/******************************************************************************/
/*-------------------------Global Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Gives the status of the Queue of a group by returning non zero value if the Queue is full
 * \param group pointer to the VADC group
 * \return status of the Queue
 *
 * \code
 * Ifx_VADC_G* group = &MODULE_VADC.G[0]; // for group 0
 * boolean queueFull = (IfxVadc_getQueueStatus(group)==IfxVadc_Status_queueFull)?TRUE:FALSE; // get Queue status for group 0
 * \endcode
 *
 */
IFX_EXTERN IfxVadc_Status IfxVadc_getQueueStatus(Ifx_VADC_G *group);

/** \} */

/** \addtogroup IfxLld_Vadc_Std_IO
 * \{ */

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Initializes a EMUX output
 * \param emux the Emux Pin which should be configured
 * \param outputMode the pin output mode which should be configured
 * \param padDriver the pad driver mode which should be configured
 * \return None
 */
IFX_INLINE void IfxVadc_initEmuxPin(const IfxVadc_Emux_Out *emux, IfxPort_OutputMode outputMode, IfxPort_PadDriver padDriver);

/** \brief Initializes a GxBFL output
 * \param gxBfl the GxBFL Pin which should be configured
 * \param outputMode the pin output mode which should be configured
 * \param padDriver the pad driver mode which should be configured
 * \return None
 */
IFX_INLINE void IfxVadc_initGxBflPin(const IfxVadc_GxBfl_Out *gxBfl, IfxPort_OutputMode outputMode, IfxPort_PadDriver padDriver);

/** \} */

/** \addtogroup IfxLld_Vadc_Std_Frequency
 * \{ */

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Calculate the time using analog frequency.
 * \param analogFrequency analog frequency in Hz.
 * \param sampleTime sample time in sec.
 * \return sample time in sec.
 */
IFX_INLINE uint32 IfxVadc_calculateSampleTime(float32 analogFrequency, float32 sampleTime);

/******************************************************************************/
/*-------------------------Global Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Returns the configured Fadci VADC analog clock frequency in Hz.
 * \param vadc pointer to the base of VADC registers
 * \return Returns the configured Fadci VADC analog clock frequency in Hz.
 */
IFX_EXTERN float32 IfxVadc_getAdcAnalogFrequency(Ifx_VADC *vadc);

/** \brief Returns the configured Fadcd VADC digital clock frequency in Hz.
 * \param vadc pointer to the base of VADC registers
 * \return Returns the configured Fadcd VADC digital clock frequency in Hz.
 */
IFX_EXTERN float32 IfxVadc_getAdcDigitalFrequency(Ifx_VADC *vadc);

/** \} */

/** \addtogroup IfxLld_Vadc_Std_Group
 * \{ */

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Clears the all group requests.
 * \param vadcG pointer to VADC group registers.
 * \return None
 */
IFX_INLINE void IfxVadc_clearAllResultRequests(Ifx_VADC_G *vadcG);

