zhanzr/TC234_Tasking_62_Demo/SoftwarePlatform/illd_tc23x/src/ifx/TC23x/Vadc/Std/IfxVadc.h
/** \brief Gets the ADC group arbitration round length.
 * \param vadcG pointer to VADC group registers.
 * \return ADC group arbitration round length.
 */
IFX_INLINE IfxVadc_ArbitrationRounds IfxVadc_getArbiterRoundLength(Ifx_VADC_G *vadcG);

/** \brief Gets the channel esult service request node pointer 0.
 * \param vadcG pointer to VADC group registers.
 * \return channel result service request node pointer 0.
 */
IFX_INLINE Ifx_VADC_G_REVNP0 IfxVadc_getChannelResultServiceRequestNodePointer0(Ifx_VADC_G *vadcG);

/** \brief Gets the channel esult service request node pointer 1.
 * \param vadcG pointer to VADC group registers.
 * \return channel result service request node pointer 1.
 */
IFX_INLINE Ifx_VADC_G_REVNP1 IfxVadc_getChannelResultServiceRequestNodePointer1(Ifx_VADC_G *vadcG);

/** \brief Gets the channel service request node pointer.
 * \param vadcG pointer to VADC group registers.
 * \return channel service request node pointer.
 */
IFX_INLINE Ifx_VADC_G_CEVNP0 IfxVadc_getChannelServiceRequestNodePointer0(Ifx_VADC_G *vadcG);

/** \brief Gets the configured master index.
 * \param vadcG pointer to VADC group registers.
 * \return configured master kernel index.
 */
IFX_INLINE uint8 IfxVadc_getMasterIndex(Ifx_VADC_G *vadcG);

/** \brief Resets the ADC group.
 * \param vadcG pointer to VADC group registers.
 * \return None
 */
IFX_INLINE void IfxVadc_resetGroup(Ifx_VADC_G *vadcG);

/** \brief Sets analog converter group number.
 * \param vadcG pointer to VADC group registers.
 * \param analogConverterMode group analog converter mode.
 * \return None
 */
IFX_INLINE void IfxVadc_setAnalogConvertControl(Ifx_VADC_G *vadcG, IfxVadc_AnalogConverterMode analogConverterMode);

/** \brief Sets the arbiter round length.
 * \param vadcG pointer to VADC group registers.
 * \param arbiterRoundLength arbiter round length.
 * \return None
 */
IFX_INLINE void IfxVadc_setArbitrationRoundLength(Ifx_VADC_G *vadcG, IfxVadc_ArbitrationRounds arbiterRoundLength);

/** \brief Sets the ADC input class channel resolution.
 * \param vadcG pointer to VADC group registers.
 * \param inputClassNum input class number.
 * \param resolution ADC input class channel resolution.
 * \return None
 */
IFX_INLINE void IfxVadc_setGroupResolution(Ifx_VADC_G *vadcG, uint8 inputClassNum, IfxVadc_ChannelResolution resolution);

/** \brief Sets the ADC input class sample time.
 * \param vadcG pointer to VADC group registers.
 * \param inputClassNum input class number.
 * \param analogFrequency ADC analog frequency in Hz.
 * \param sampleTime request sample time in sec for input class.
 * \return None
 */
IFX_INLINE void IfxVadc_setGroupSampleTime(Ifx_VADC_G *vadcG, uint8 inputClassNum, float32 analogFrequency, float32 sampleTime);

/** \brief Sets the master index.
 * \param vadcG pointer to VADC group registers.
 * \param masterIndex master index.
 * \return None
 */
IFX_INLINE void IfxVadc_setMasterIndex(Ifx_VADC_G *vadcG, uint8 masterIndex);

/******************************************************************************/
/*-------------------------Global Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Sets the Arbiter slot configurations.
 * \param vadcG pointer to VADC group registers.
 * \param slotEnable enable/disable of slot.
 * \param prio channel request priority.
 * \param mode Channel Slot start mode.
 * \param slot channel slot Request source.
 * \return None
 */
IFX_EXTERN void IfxVadc_setArbiterPriority(Ifx_VADC_G *vadcG, boolean slotEnable, IfxVadc_RequestSlotPriority prio, IfxVadc_RequestSlotStartMode mode, IfxVadc_RequestSource slot);

/** \} */

/** \addtogroup IfxLld_Vadc_Std_Module
 * \{ */

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Disable VADC Module
 * \param vadc Pointer to VADC Module
 * \return None
 */
IFX_INLINE void IfxVadc_disableModule(Ifx_VADC *vadc);

/** \brief Enable VADC kernel.
 * \param vadc pointer to the base of VADC registers.
 * \return None
 */
IFX_INLINE void IfxVadc_enableModule(Ifx_VADC *vadc);

/** \brief gets ADC Calibration Flag CAL status.
 * \param vadc pointer to VADC group registers.
 * \param adcCalGroupNum ADC CAL group number.
 * \return CAL group status.
 */
IFX_INLINE uint8 IfxVadc_getAdcCalibrationActiveState(Ifx_VADC *vadc, uint8 adcCalGroupNum);

/** \brief Gets the global control configuration value.
 * \param vadc pointer to the base of VADC registers.
 * \return global control configuration value.
 */
IFX_INLINE Ifx_VADC_GLOBCFG IfxVadc_getGlobalConfigValue(Ifx_VADC *vadc);

/** \brief get SUCAL bit field status
 * \param vadc Pointer to VADC Module
 * \return Indicate the start-up calibration phase
 */
IFX_INLINE boolean IfxVadc_getStartupCalibration(Ifx_VADC *vadc);

/** \brief initiates the calibration pulse phase.
 * \param vadc pointer to the base of VADC registers
 * \return None
 */
IFX_INLINE void IfxVadc_initiateStartupCalibration(Ifx_VADC *vadc);

/** \brief Sets the channel conversion mode.
 * \param vadc pointer to VADC module registers.
 * \param inputClassNum global input class  number.
 * \param resolution ADC channel resolution.
 * \return None
 */
IFX_INLINE void IfxVadc_setGlobalResolution(Ifx_VADC *vadc, uint8 inputClassNum, IfxVadc_ChannelResolution resolution);

/** \brief Sets the sample time of ADC global class.
 * \param vadc pointer to VADC module registers.
 * \param inputClassNum global input class  number.
 * \param analogFrequency ADC analog frequency in Hz.
 * \param sampleTime the requested sample time for input class in sec.
 * \return None
 */
IFX_INLINE void IfxVadc_setGlobalSampleTime(Ifx_VADC *vadc, uint8 inputClassNum, float32 analogFrequency, float32 sampleTime);

/** \brief Sets the sensitivity of the module to sleep signal
 * \param vadc pointer to VADC registers
 * \param mode mode selection (enable/disable)
 * \return None
 */
IFX_INLINE void IfxVadc_setSleepMode(Ifx_VADC *vadc, IfxVadc_SleepMode mode);

/******************************************************************************/
/*-------------------------Global Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Disable write access to the VADC config/control registers.
 * \param vadc pointer to the base of VADC registers.
 * \param protectionSet Index of the bit in the ACCPROTx {x=0/1} for which write access is to be disabled.
 * \return None
 */
IFX_EXTERN void IfxVadc_disableAccess(Ifx_VADC *vadc, IfxVadc_Protection protectionSet);

/** \brief Disables the post calibration.
 * \param vadc pointer to the base of VADC registers.
 * \param group Index of the group.
 * \param disable disable or not.
 * \return None
 */
IFX_EXTERN void IfxVadc_disablePostCalibration(Ifx_VADC *vadc, IfxVadc_GroupId group, boolean disable);

