zhanzr/TC234_Tasking_62_Demo/SoftwarePlatform/illd_tc23x/src/ifx/TC23x/Vadc/Std/IfxVadc.h
/** \brief Enable write access to the VADC config/control registers.
 * \param vadc pointer to the base of VADC registers.
 * \param protectionSet Index of the bit in the ACCPROTx {x=0/1} for which write access is to be enabled.
 * \return None
 */
IFX_EXTERN void IfxVadc_enableAccess(Ifx_VADC *vadc, IfxVadc_Protection protectionSet);

/** \brief Enables the CCU6 based ADC group synchronisation as workaround for Erratum ADC_TC.068
 * \param vadc pointer to the base of VADC registers.
 * \param ccu6Num selects CCU60 or CCU61
 * \return None
 */
IFX_EXTERN void IfxVadc_enableGroupSync(Ifx_VADC *vadc, uint32 ccu6Num);

/** \brief Module Frequency in Hz
 * \return Module Frequency in Hz.
 */
IFX_EXTERN float32 IfxVadc_getAdcModuleFrequency(void);

/** \brief Gives the SRC source address.
 * \param group Index of the group
 * \param index SRC number
 * \return SRC source address
 */
IFX_EXTERN volatile Ifx_SRC_SRCR *IfxVadc_getSrcAddress(IfxVadc_GroupId group, IfxVadc_SrcNr index);

/** \brief Initialises ADC arbiter clock.
 * \param vadc pointer to the base of VADC registers
 * \param arbiterClockDivider ADC arbiter clock divider.
 * \return None
 */
IFX_EXTERN void IfxVadc_initialiseAdcArbiterClock(Ifx_VADC *vadc, uint32 arbiterClockDivider);

/** \brief Initialises the ADC Converter clock.
 * \param vadc pointer to the base of VADC registers
 * \param converterClockDivider ADC converter clock divider.
 * \return None
 */
IFX_EXTERN void IfxVadc_initialiseAdcConverterClock(Ifx_VADC *vadc, uint32 converterClockDivider);

/** \brief Configure the FadcD vadc digital clock.
 * \param vadc pointer to the base of VADC registers.
 * \param fAdcD ADC digital clock frequency in Hz.
 * \return calculated ADC digital clock frequency in Hz.
 */
IFX_EXTERN uint32 IfxVadc_initializeFAdcD(Ifx_VADC *vadc, uint32 fAdcD);

/** \brief Configure the ADC analog clock.
 * \param vadc pointer to the base of VADC registers.
 * \param fAdcI ADC analog clock clock frequency in Hz. Range = [5000000, 10000000].
 * \return ADC analog clock frequency in Hz.
 */
IFX_EXTERN uint32 IfxVadc_initializeFAdcI(Ifx_VADC *vadc, uint32 fAdcI);

/** \brief Return the post calibration status
 * \param vadc Pointer to VADC module
 * \param group specifies Group ID
 * \return TRUE if the post calibration is enabled for the group else false
 */
IFX_EXTERN boolean IfxVadc_isPostCalibration(Ifx_VADC *vadc, IfxVadc_GroupId group);

/** \brief Resets the kernel.
 * \param vadc pointer to the base of VADC registers.
 * \return None
 */
IFX_EXTERN void IfxVadc_resetKernel(Ifx_VADC *vadc);

/** \brief Select Low Power Supply Voltage
 * \param vadc Pointer to Module space
 * \param supplyVoltage Select Supply Voltage
 * \return None
 */
IFX_EXTERN void IfxVadc_selectPowerSupplyVoltage(Ifx_VADC *vadc, IfxVadc_LowSupplyVoltageSelect supplyVoltage);

/** \brief Starts ADC calibration and wait for the end of the calibration process.
 * \param vadc pointer to the base of VADC registers.
 * \return None
 */
IFX_EXTERN void IfxVadc_startupCalibration(Ifx_VADC *vadc);

/** \} */

/** \addtogroup IfxLld_Vadc_Std_Channel
 * \{ */

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Clears the channel request.
 * \param vadcG pointer to VADC group registers.
 * \param channelId channel id whose request to be cleared.
 * \return None
 */
IFX_INLINE void IfxVadc_clearChannelRequest(Ifx_VADC_G *vadcG, IfxVadc_ChannelId channelId);

/** \brief Enables the FIFO mode.
 * \param vadcG pointer to VADC group registers.
 * \param resultRegister channel result register.
 * \param fifoMode FIFO mode .
 * \return None
 */
IFX_INLINE void IfxVadc_enableFifoMode(Ifx_VADC_G *vadcG, IfxVadc_ChannelResult resultRegister, IfxVadc_FifoMode fifoMode);

/**
 * \param vadcG pointer to VADC group registers.
 * \param resultRegister channel result register.
 * \return None
 */
IFX_INLINE void IfxVadc_enableServiceRequest(Ifx_VADC_G *vadcG, IfxVadc_ChannelResult resultRegister);

/** \brief Gets the group's assigned channels.
 * \param vadcG pointer to VADC group registers.
 * \return group's assigned channels.
 */
IFX_INLINE Ifx_VADC_G_CHASS IfxVadc_getAssignedChannels(Ifx_VADC_G *vadcG);

/** \brief Gets the current ADC channel control configurations.
 * \param vadcG pointer to VADC group registers.
 * \param channelIndex ADC channel number.
 * \return current ADC channel control configuration.
 */
IFX_INLINE Ifx_VADC_CHCTR IfxVadc_getChannelControlConfig(Ifx_VADC_G *vadcG, IfxVadc_ChannelId channelIndex);

/** \brief Gets the channel input class
 * \param vadcG pointer to VADC Group register space
 * \param channelIndex specifies channel ID
 * \return Input class
 */
IFX_INLINE IfxVadc_InputClasses IfxVadc_getChannelInputClass(Ifx_VADC_G *vadcG, IfxVadc_ChannelId channelIndex);

/** \brief Gets the ADC input class channel resolution.
 * \param vadcG pointer to VADC group registers.
 * \param inputClassNum ADC input class number.
 * \return ADC input class channel resolution.
 */
IFX_INLINE IfxVadc_ChannelResolution IfxVadc_getGroupResolution(Ifx_VADC_G *vadcG, uint8 inputClassNum);

/** \brief Gets the ADC input class channel sample time.
 * \param vadcG pointer to VADC group registers.
 * \param inputClassNum ADC input class number.
 * \param analogFrequency ADC module analog frequency in Hz.
 * \return ADC input class channel sample time in sec.
 */
IFX_INLINE float32 IfxVadc_getGroupSampleTime(Ifx_VADC_G *vadcG, uint8 inputClassNum, float32 analogFrequency);

/** \brief Sets the channels with low priority as background channel.
 * \param vadcG pointer to VADC group registers.
 * \param channelIndex group channel id.
 * \return None
 */
IFX_INLINE void IfxVadc_setBackgroundPriorityChannel(Ifx_VADC_G *vadcG, IfxVadc_ChannelId channelIndex);

/** \brief Sets the target for result background source.
 * \param vadcG pointer to VADC group registers.
 * \param channelIndex group channel id.
 * \param globalResultUsage whether storage in global result register.
 * \return None
 */
IFX_INLINE void IfxVadc_setBackgroundResultTarget(Ifx_VADC_G *vadcG, IfxVadc_ChannelId channelIndex, boolean globalResultUsage);

/** \brief Selects boundary extension.
 * \param vadcG pointer to VADC group registers.
 * \param channelIndex group channel id.
 * \param boundaryMode boundary extension mode.
 * \return None
 */
IFX_INLINE void IfxVadc_setBoundaryMode(Ifx_VADC_G *vadcG, IfxVadc_ChannelId channelIndex, IfxVadc_BoundaryExtension boundaryMode);

